{
  "portfolio": "See my portfolio",
  "qr.bar": "Scan or click",

  "aboutMe.h1": "About me",
  "aboutMe.p": "I'm independently developing my frontend skills by building projects using HTML, SASS, JavaScript and React. I enjoy solving problems and turning ideas into modern, aesthetic, and responsive websites. I'm looking for my first opportunity to join an IT team and grow in a professional environment.",

  "language.title": "Languages",
  "language.polish": "Polish (native)",
  "language.english": "English B2",

  "skills.tag": "Skills",
  "skills.accordion": "I demonstrate my detailed skills best through practical work — feel free to check out my portfolio to see real projects and the technologies I’ve used.",
  "skills.rwd": "Responsive design (RWD)",
  "skills.ui": "Creating UI components",

  "education.tag": "Education",
  "education.accordion1": "I made the decision to pause my studies to focus on self-development as a Frontend Developer with a goal to become full-stack. I am intensively learning HTML5, CSS3 (including SASS), JavaScript (ES6+), and React.",
  "education.accordion2": "My learning takes place through online courses, practical projects, and regular practice, as well as building a portfolio. This approach allows me to gain up-to-date, practical skills aligned with the IT job market.",
  "education.studies": "Cracow University of Technology",
  "education.ele": "Electrical Engineering and Automation (3 semesters)",
  "education.inf": "Computer Science (1 semester, continuation from the 3rd semester)",
  "education.break": "Studies paused – focusing on self-learning Frontend development",
  "education.hSchool": "Technical High School No. 3 in Sanok",
  "education.mech": "Mechatronics Technician | Qualifications: E03, E18",

  "experience.tag": "Experience",
  "experience.accordion": "I started working as a courier during my studies because the flexible schedule let me balance work and learning. Over time, I valued not only the flexibility but also the chance to earn well without full-time hours. This has allowed me to spend more time developing frontend skills, completing courses, and building my portfolio.",
  "experience.courier": "Courier – Delivery platforms",
  "experience.courierTime": "(2022 – present)",
  "experience.courier1": "Efficient time and route management",
  "experience.courier2": "Customer communication and problem-solving",
  "experience.courier3": "Adaptability to changing work conditions",

  "goals.tag": "Goals",
  "goals.accordion1": "I see TypeScript as a natural extension of JavaScript that helps create more predictable and scalable code. I plan to learn it to better prepare for teamwork on larger projects.",
  "goals.accordion2": "I plan to learn backend development as a complementary step, aiming to grow into a Fullstack Developer in the future."
}
